src/cf/DataProcessors/вогНачальнаяСтраницаПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<DataProcessor>
		<Properties>
			<Name>вогНачальнаяСтраницаПользователя</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/вогМенеджерыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>вогМенеджерыОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьБрендМенеджерВТТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.вогВладелецМенеджеров</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиКонтактныхЛицПартнеров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БрендМенеджер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/СтруктураПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>СтруктураПредприятия</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийРуководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_МаксимальноеКоличествоБалловВДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Офис</Name>
					<Comment>Офис компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ОфисыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ПериодРасчетаПотенциала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ПериодыРасчетаПотенциала</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ПроцентПревышенияКоличестваБаллов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ФормулаРасчетаПотенциала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>вогПредставлениеДляОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>вогДопРеквизитУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>вогДопРеквизитУпорядочиванияИтог</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>CRM_ТипУслуги</Name>
					<Comment>Тип услуги</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипУслуги</Name>
							<Comment>Тип услуги</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ТипУслуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/БрендЗона.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>БрендЗона</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСтендов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБрендЗоны</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыБрендЗоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМагазина</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидМагазина</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервойУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыБрендЗоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоSKU106</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоSKU053</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КодыУПП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодУПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерУПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаАренды</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияАренды</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоSKU106</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоSKU053</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОборотСПолкиПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗакрытияФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидБрендЗоны</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыБрендЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/вогНачальнаяСтраницаПользователя/Forms/КлиентыБрендЗоны/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	вогНачальнаяСтраницаПользователяКлиетСервер.НачальнаяСтраницаПользователяПриСозданииНаСервере(ЭтаФорма);
	// ++ VOG Солодов В.В. 17.02.2021 TRG-277
	ЗаполнитьТаблицуОтборов();
	// -- VOG Солодов В.В. 17.02.2021 TRG-277
	// ++ VOG Солодов В.В. 15.09.2021 CRM-1214
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		СписокБрендЗоны,
		"ТекущаяДата",
		ТекущаяДатаСеанса());
	// -- VOG Солодов В.В. 15.09.2021 CRM-1214
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("УстановитьПунктМеню",0.1,Истина);
	// ++ VOG Солодов В.В. 17.02.2021 TRG-277
	ПриИзмененииПоляОтбораНаКлиенте();
	// -- VOG Солодов В.В. 17.02.2021 TRG-277
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПунктМеню()
	Если Элементы.МенюHTML.Документ <> Неопределено Тогда
		Если Элементы.МенюHTML.Документ.readyState = "complete" Тогда
			вогНачальнаяСтраницаПользователяКлиетСервер.НачальнаяСтраницаПользователяПриОткрытии(ЭтаФорма,"бренд-зоны");
			//ОтключитьОбработчикОжидания("УстановитьПунктМеню");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_МенюHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если ДанныеСобытия.Element <> Неопределено Тогда
		вогНачальнаяСтраницаПользователяКлиетСервер.МенюHTMLПриНажатии(ЭтаФорма,"бренд-зоны");
	КонецЕсли;
		
КонецПроцедуры

// ++ VOG Солодов В.В. 17.02.2021 TRG-277
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПриИзмененииПоляОтбора(Элемент)
	
	ПриИзмененииПоляОтбораНаКлиенте(Элемент.Имя);
	
	вогОбщегоНазначенияКлиентСервер.ПоказатьСкрытьКнопкуОчисткиОтбора(Элемент, ЭтотОбъект[Элемент.Имя]);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПодразделениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МассивЗначений = ПолучитьСтруктуруОтбора("Подразделение").Подразделение;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Ссылка", МассивЗначений);
	СтруктураОтбора.Вставить("ОбособленноеПодразделение", Истина);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", СтруктураОтбора);
	
	Если ЗначениеЗаполнено(ОтборПодразделение) И Не МассивЗначений.Найти(ОтборПодразделение) = Неопределено Тогда
		ПараметрыФормы.Вставить("ТекущаяСтрока", ОтборПодразделение);
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ПолеОтбораВыборЗавершение",
		ЭтотОбъект,
		Элемент.Имя);
	
	ОткрытьФорму(
		"Справочник.СтруктураПредприятия.Форма.CRM_ФормаВыбора",
		ПараметрыФормы,
		ЭтотОбъект,
		,
		,
		,
		ОповещениеОЗавершении,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборМенеджерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", 			Истина);
	ПараметрыФормы.Вставить("СписокПользователей", 	ПолучитьСтруктуруОтбора("Менеджер").Менеджер);
	ПараметрыФормы.Вставить("СписокПодразделений", 	ПолучитьСтруктуруОтбора("Подразделение", Ложь).Подразделение);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ПолеОтбораВыборЗавершение",
		ЭтотОбъект,
		Элемент.Имя);
	
	ОткрытьФорму(
		"Справочник.Пользователи.Форма.CRM_ФормаСписка",
		ПараметрыФормы,
		ЭтотОбъект,
		,
		,
		,
		ОповещениеОЗавершении,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборРегионНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МассивЗначений = ПолучитьСтруктуруОтбора("Регион").Регион;
	
	СтруктураОтбора = Новый Структура("Ссылка", МассивЗначений);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", СтруктураОтбора);
	
	Если ЗначениеЗаполнено(ОтборРегион) И Не МассивЗначений.Найти(ОтборРегион) = Неопределено Тогда
		ПараметрыФормы.Вставить("ТекущаяСтрока", ОтборРегион);
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ПолеОтбораВыборЗавершение",
		ЭтотОбъект,
		Элемент.Имя);
	
	ОткрытьФорму(
		"Справочник.вогНаселенныеПункты.ФормаВыбора",
		ПараметрыФормы,
		ЭтотОбъект,
		,
		,
		,
		ОповещениеОЗавершении,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПартнерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВариантКлассификации", "Партнеры");
	
	НовыйОтбор = Новый ОтборКомпоновкиДанных;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		НовыйОтбор,
		"Ссылка",
		ПолучитьСтруктуруОтбора("Партнер").Партнер,
		ВидСравненияКомпоновкиДанных.ВСписке);
	
	ПараметрыФормы.Вставить("ОтборКомпоновкиДанных", НовыйОтбор);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ПолеОтбораВыборЗавершение",
		ЭтотОбъект,
		Элемент.Имя);
	
	ОткрытьФорму(
		"ОбщаяФорма.вогПодборКлиентскаяБазаДинамический",
		ПараметрыФормы,
		ЭтотОбъект,
		,
		,
		,
		ОповещениеОЗавершении,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеОтбораВыборЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект[ДополнительныеПараметры] = Результат;
	ПриИзмененииПоляОтбораНаКлиенте(ДополнительныеПараметры);
	вогОбщегоНазначенияКлиентСервер.ПоказатьСкрытьКнопкуОчисткиОтбора(
		Элементы[ДополнительныеПараметры], ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриИзмененииПоляОтбораНаКлиенте(Знач ИмяПоляОтбора = "", Знач СтруктураОтбора = Неопределено)
	
	Если СтруктураОтбора = Неопределено Тогда
		СтруктураОтбора = ПолучитьСтруктуруОтбора();
	КонецЕсли;
	
	СписокПолейОтбора = Новый Массив;
	СписокПолейОтбора.Добавить("Подразделение");
	СписокПолейОтбора.Добавить("Менеджер");
	СписокПолейОтбора.Добавить("Регион");
	СписокПолейОтбора.Добавить("Партнер");
	
	Для Каждого ИмяПоля Из СписокПолейОтбора Цикл
		
		ИмяЭлемента = СтрШаблон("Отбор%1", ИмяПоля);
		
		Если ИмяЭлемента = ИмяПоляОтбора
			И ЗначениеЗаполнено(ЭтотОбъект[ИмяЭлемента]) Тогда
			Продолжить;
		КонецЕсли;
		
		МассивЗначений = СтруктураОтбора[ИмяПоля];
		
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивЗначений));
		
		МассивПараметров = Новый Массив();
		МассивПараметров.Добавить(НовыйПараметр);
		
		Если ИмяПоля = "Подразделение" Тогда
			
			НовыйПараметр = Новый ПараметрВыбора("Отбор.ОбособленноеПодразделение", Истина);
			МассивПараметров.Добавить(НовыйПараметр);
			Если ЗначениеЗаполнено(ОтборПодразделение) И Не МассивЗначений.Найти(ОтборПодразделение) = Неопределено Тогда
				НовыйПараметр = Новый ПараметрВыбора("ТекущаяСтрока", ОтборПодразделение);
				МассивПараметров.Добавить(НовыйПараметр);
			КонецЕсли;
			
		ИначеЕсли ИмяПоля = "Менеджер" Тогда
			
			НовыйПараметр = Новый ПараметрВыбора("СписокПользователей", МассивЗначений);
			МассивПараметров.Добавить(НовыйПараметр);
			
			МассивЗначений = СтруктураОтбора.Подразделение;
			
			НовыйПараметр = Новый ПараметрВыбора("СписокПодразделений", МассивЗначений);
			МассивПараметров.Добавить(НовыйПараметр);
			
			//НовыйПараметр = Новый ПараметрВыбора("ТолькоДоступные", Истина);
			//МассивПараметров.Добавить(НовыйПараметр);
			
		ИначеЕсли ИмяПоля = "Регион"
			И ЗначениеЗаполнено(ОтборРегион)
			И Не МассивЗначений.Найти(ОтборРегион) = Неопределено Тогда
			
			НовыйПараметр = Новый ПараметрВыбора("ТекущаяСтрока", ОтборРегион);
			МассивПараметров.Добавить(НовыйПараметр);
			
		КонецЕсли;
			
		Элементы[ИмяЭлемента].ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СписокБрендЗоны,
		"ТорговаяТочка",
		СтруктураОтбора.ТорговаяТочка,
		ВидСравненияКомпоновкиДанных.ВСписке,
		,
		Истина);
		
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруОтбора(ИмяПоля = "", ДобавитьДополнительноеЗначение = Истина)
	
	ПараметрыОтбораСтрок = Новый Структура;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ТорговаяТочка", Новый Массив);
	СтруктураОтбора.Вставить("Подразделение", Новый Массив);
	СтруктураОтбора.Вставить("Менеджер", Новый Массив);
	СтруктураОтбора.Вставить("Партнер", Новый Массив);
	СтруктураОтбора.Вставить("Регион", Новый Массив);
	СтруктураОтбора.Вставить("РегионРодитель", Новый Массив);
	
	Если ЗначениеЗаполнено(ОтборПодразделение) И Не ИмяПоля = "Подразделение" Тогда
		ПараметрыОтбораСтрок.Вставить("Подразделение", ОтборПодразделение);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборМенеджер) И Не ИмяПоля = "Менеджер" Тогда
		ПараметрыОтбораСтрок.Вставить("Менеджер", ОтборМенеджер);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборРегион) И Не ИмяПоля = "Регион" Тогда
		ПараметрыОтбораСтрок.Вставить("Регион", ОтборРегион);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборПартнер) И Не ИмяПоля = "Партнер" Тогда
		ПараметрыОтбораСтрок.Вставить("Партнер", ОтборПартнер);
	КонецЕсли;
	
	НайденныеСтроки = ТаблицаОтборов.НайтиСтроки(ПараметрыОтбораСтрок);
	
	Для Каждого СтрокаТабличнойЧасти Из НайденныеСтроки Цикл
		
		Для Каждого КлючИЗначение Из СтруктураОтбора Цикл
			
			ДобавляемоеЗначение = СтрокаТабличнойЧасти[КлючИЗначение.Ключ];
			
			Если КлючИЗначение.Значение.Найти(ДобавляемоеЗначение) = Неопределено Тогда
				КлючИЗначение.Значение.Добавить(ДобавляемоеЗначение);
			КонецЕсли;
			
			Если ДобавитьДополнительноеЗначение Тогда
				
				ДополнительноеЗначение = Неопределено;
				
				Если КлючИЗначение.Ключ = "Регион" Тогда
					ДополнительноеЗначение = СтрокаТабличнойЧасти.РегионРодитель;
				ИначеЕсли КлючИЗначение.Ключ = "Подразделение" Тогда
					// +++ VOG Кулаков П.Л. 29.04.2021 DEV-235
					//ДополнительноеЗначение = ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ОсновноеПодразделение");
					// --- VOG Кулаков П.Л.
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ДополнительноеЗначение)
					И КлючИЗначение.Значение.Найти(ДополнительноеЗначение) = Неопределено Тогда
					КлючИЗначение.Значение.Добавить(ДополнительноеЗначение);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат СтруктураОтбора;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуОтборов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СпрТорговыеТочки.Ссылка КАК ТорговаяТочка,
		|	СпрТорговыеТочки.Партнер КАК Партнер,
		|	СпрТорговыеТочки.НаселенныйПунктРегион КАК Регион
		|ПОМЕСТИТЬ ВТ_ТорговыеТочки
		|ИЗ
		|	Справочник.вогТорговыеТочки КАК СпрТорговыеТочки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БрендЗона КАК БрендЗоны
		|		ПО СпрТорговыеТочки.Ссылка = БрендЗоны.ТорговаяТочка
		|ГДЕ
		|	НЕ БрендЗоны.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВТ_ТорговыеТочки.ТорговаяТочка КАК ТорговаяТочка,
		|	ВТ_ТорговыеТочки.Партнер КАК Партнер,
		|	ВТ_ТорговыеТочки.Регион КАК Регион,
		|	ЕСТЬNULL(МенеджерыОбъектов.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение,
		|	ЕСТЬNULL(МенеджерыОбъектов.Менеджер, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК Менеджер
		|ПОМЕСТИТЬ ВТ_Подготовленная
		|ИЗ
		|	ВТ_ТорговыеТочки КАК ВТ_ТорговыеТочки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вогМенеджерыОбъектов КАК МенеджерыОбъектов
		|		ПО ВТ_ТорговыеТочки.ТорговаяТочка = МенеджерыОбъектов.Владелец
		|			И (МенеджерыОбъектов.НаправлениеДеятельности = &НаправлениеДеятельности)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Подготовленная.ТорговаяТочка КАК ТорговаяТочка,
		|	ВТ_Подготовленная.Партнер КАК Партнер,
		|	ВТ_Подготовленная.Регион КАК Регион,
		|	ВТ_Подготовленная.Регион.Родитель КАК РегионРодитель,
		|	ВТ_Подготовленная.Подразделение КАК Подразделение,
		|	ВТ_Подготовленная.Менеджер КАК Менеджер
		|ИЗ
		|	ВТ_Подготовленная КАК ВТ_Подготовленная";
	
	Запрос.УстановитьПараметр("НаправлениеДеятельности", Справочники.НаправленияДеятельности.Обои);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = ТаблицаОтборов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		
		// Заполнение иерархии регионов
		Если ЗначениеЗаполнено(НоваяСтрока.РегионРодитель) Тогда
			
			Родитель = НоваяСтрока.РегионРодитель;
			
			Пока ЗначениеЗаполнено(Родитель) Цикл
				
				НоваяСтрока = ТаблицаОтборов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
				НоваяСтрока.РегионРодитель = Родитель;
				
				Родитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Родитель, "Родитель", Истина);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
// -- VOG Солодов В.В. 17.02.2021 TRG-277
